
while True:
    try:
        age = int(input("შემოიტანეთ თქვენი ასაკი: "))
        if age > 0:
            break
        else:
            print("ასაკი უნდა იყოს დადებითი რიცხვი.")
    except ValueError:
        print("გთხოვთ, შეიყვანოთ სწორი რიცხვი.")
while True:

        can_purchase = float(input("შემოიტანეთ შესყიდვის მთლიანი თანხა ($): "))
        if can_purchase > 0:
            break
        else:
            print("შესყიდვის თანხა უნდა იყოს დადებითი რიცხვი.")
 
        print("გთხოვთ, შეიყვანოთ სწორი რიცხვი.")
if age > 60 and can_purchase >= 100:
    print("თქვენ გაქვთ უფლება უფრო მაღალი ფასდაკლების მიღებაზე!")
elif age > 60:
    print("თქვენ გაქვთ უფლება ფასდაკლებაზე ასაკის მიხედვით.")
elif can_purchase >= 100:
    print("თქვენ გაქვთ უფლება ფასდაკლებაზე შესყიდვის მთლიანი თანხის მიხედვით.")
else:
    print("სამწუხაროდ, თქვენ არ გაქვთ ფასდაკლების უფლება.")
