
while True:

        gpa = float(input("შემოიტანეთ თქვენი GPA (საშუალო ქულა): "))
        if gpa >= 0:
            break
        else:
            print("GPA უნდა იყოს დადებითი რიცხვი.")

        print("გთხოვთ, შეიყვანოთ სწორი რიცხვი.")

 
        income = float(input("შემოიტანეთ ოჯახის შემოსავალი ($): "))
        if income >= 0:
            break
        else:
            print("შემოსავალი უნდა იყოს დადებითი რიცხვი.")

        print("გთხოვთ, შეიყვანოთ სწორი რიცხვი.")
if gpa >= 3.5:
    print("თქვენ გაქვთ უფლება სტიპენდიის მისაღებად!")
elif gpa >= 3.0 and income < 50000:
    print("თქვენ გაქვთ უფლება უმაღლესი სტიპენდიის მისაღებად!")
elif gpa >= 3.0:
    print("თქვენ გაქვთ უფლება სტიპენდიის მისაღებად!")
else:
    print("სამწუხაროდ, თქვენ არ გაქვთ უფლება სტიპენდიის მისაღებად.")
